_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 78, 78, 32)        896       
_________________________________________________________________
activation_12 (Activation)   (None, 78, 78, 32)        0         
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 39, 39, 32)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 37, 37, 32)        9248      
_________________________________________________________________
activation_13 (Activation)   (None, 37, 37, 32)        0         
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 18, 18, 32)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 16, 16, 64)        18496     
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 16, 16, 64)        0         
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 8, 8, 64)          0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 64)                262208    
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 64)                0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 5)                 325       
_________________________________________________________________
activation_14 (Activation)   (None, 5)                 0         
=================================================================
Total params: 291,173
Trainable params: 291,173
Non-trainable params: 0
_________________________________________________________________
